Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/employment_rights_and_conditions/industrial_relations_and_trade_unions/trade_disputes.html.txt.tmx
Source language: en
Languages: ga

source: Trade disputes and industrial action
ga: Díospóidí trádála agus gníomhaíocht thionsclaíoch

source: Most of the law on trade disputes and industrial action is contained in the Industrial Relations Act 1990
ga: Tá an chuid is mó den dlí ar dhíospóidí trádála agus gníomhaíocht thionsclaíoch cuimsithe san Acht Caidrimh Thionscail, 1990

source: Under Section 8 of the Act a trade dispute “means any dispute between employers and workers which is connected with the employment or non-employment, or the terms or conditions of or affecting the employment, of any person”
ga: Faoi Alt 8 den Acht, ciallaíonn aighneas ceirde (díospóid trádála) “aon aighneas idir fostóirí agus oibrithe atá bainteach le fostaíocht nó neamhfhostaíocht, nó le téarmaí nó coinníollacha fostaíochta, aon duine nó le téarmaí nó coinníollacha a dhéanann difear d’fhostaíocht nó aon duine”

source: An industrial action is any action which may affect the terms of a contract which is taken by workers acting together to compel their employer “to accept or not to accept terms or conditions of or affecting employment.” Examples of industrial action include a work to rule, a picket, an overtime ban or a strike
ga: Ciallaíonn “gníomh tionscail” (gníomhaíocht thionsclaíoch) “aon ghníomh a dhéanann difear, nó ar dóigh dó difear a dhéanamh, do théarmaí nó coinníollacha conartha, a dhéanann oibrithe ag gníomhú le chéile chun tabhairt ar a bhfostóir “glacadh nó gan glacadh le téarmaí nó coinníollacha fostaíochta nó le téarmaí nó coinníollacha a dhéanfadh difear d’fhostaíocht.” I measc na samplaí de ghníomhaíocht thionsclaíoch tá oibriú de réir rialach, picéadú, toirmeasc a chur ar ragobair nó stailc

source: Employees have a constitutional right to join a trade union
ga: Tá an ceart bunreachtúil ag fostaithe bheith mar bhaill de cheardchumann

source: It can be made a condition of employment that you must join a particular union upon accepting a job offer and remain in that union while you remain an employee in that job
ga: Féadfaidh sé bheith mar choinníoll fostaíochta go ndéantar ball de cheardchumann ar leith thú tar éis glacadh le tairiscint poist agus go bhfanann tú leis an gceardchumann sin fad a bhíonn tú mar fhostaí sa phost sin

source: There is a view that this may not be constitutional, but this has not been tested in the courts yet
ga: Measann roinnt daoine go dtarlódh nach gcloíonn seo leis an mbunreacht, ach ní dhearnadh seo a thástáil sna cúirteanna go fóill

source: If you are already in the job without being a union member and are at a later stage required to join a union by your employer, you can refuse, as such a requirement is unconstitutional
ga: Má tá an post agat cheana féin agus mura bhfuil tú mar bhall de cheardchumann, agus má cheanglaíonn d’fhostóir ort níos déanaí bheith mar bhall de cheardchumann, féadfaidh tú diúltú dó seo, mar gheall nach ceanglas bunreachtúil seo

source: In employment law there is no right to take industrial action but there are protections for certain workers who do this by, for example, going on strike
ga: Sa dlí fostaíochta, ní ann d’aon cheart chun dul i mbun gníomhaíocht thionsclaíoch, ach tá cosaint ann le haghaidh oibrithe áirithe a théann ina bhun seo, mar shampla, dul ar stailc

source: Part 2 of the Industrial Relations Act 1990 provides workers, who are taking part in peaceful industrial action, the following immunities from:
ga: Forálann Cuid 2 den Acht Caidrimh Thionscail, 1990 na díolúintí i leith an mhéid a leanas d’oibrithe a théann i mbun gníomhaíocht thionsclaíoch shíochánta:

source: Criminal or civil proceedings for conspiracy to do a particular act if the action taken by a person acting alone would not be punishable as a crime
ga: Imeachtaí coiriúla nó sibhialta i gcomhcheilg chun gníomh ar leith a dhéanamh mura mbeadh an gníomh a dhéanfadh an duine ag gníomhú leo féin inphionóis mar choir

source: Even if you are not a member of a trade union, you benefit from this immunity
ga: Fiú mura ball de cheardchumann thú, baineann tú tairbhe ón díolúine seo

source: Prosecution when taking part in peaceful picketing
ga: Ionchúiseamh nuair a ghlactar páirt i bpicéadú síochánta

source: Only members and officials of an authorised trade union get the benefit of this immunity
ga: Ní bhaineann ach baill agus oifigigh de cheardchumann údaraithe tairbhe as an díolúine seo

source: Prosecution for inducements to break or threats to break contracts of employment
ga: Ionchúiseamh mar gheall ar spreagthaí chun conarthaí fostaíochta a shárú nó bagairtí chun conarthaí fostaíochta a shárú

source: Again, only members and officials of an authorised trade union get the benefit of this immunity
ga: Arís eile, ní bhaineann ach baill agus oifigigh de cheardchumann údaraithe tairbhe as an díolúine seo

source: If you take part in industrial action such as a strike, there is a risk that you will be dismissed
ga: Má ghlacann tú páirt i ngníomhaíocht thionsclaíoch, ar nós stailce, tá an baol ann go ndífhostófar thú

source: However, under section 5 of the Unfair Dismissals Act 1977 the dismissal of an employee for taking part in a strike or other industrial action is unfair if:
ga: Faoi Alt 5 den Acht um Dhífhostú Éagórach, 1977, áfach, is ionann agus éagórach dífhostú fostaí mar gheall ar pháirt a ghlacadh i stailc nó i ngníomhaíocht thionsclaíoch eile:

source: • One or more of the other employees taking part in the action were not dismissed
ga: • Murar dífhostaíodh duine amháin nó níos mó de na fostaithe eile a bhí ag glacadh páirte sa ghníomhaíocht

source: • One or more of the other employees who were dismissed, were later reinstated or re-engaged and the employee was not
ga: • Má rinneadh duine amháin nó níos mó de na fostaithe eile a dífhostaíodh, a athfhostú níos déanaí, agus níor athfhostaíodh an fostaí

source: This was amended by section 4 of the Unfair Dismissals (Amendment) Act 1993 which extends this definition of unfair dismissal to include less favourable treatment after reinstatement or re-engagement after a strike or a lockout
ga: Rinne Alt 4 den Acht um Dhífhostú Éagórach (Leasú), 1993 é seo a leasú. Déanann an tAcht seo an sainmhíniú seo ar dhífhostú éagórach a shíneadh chun caitheamh nach bhfuil chomh fabhrach céanna a áireamh tar éis athfhostú i ndiaidh stailce nó frithdhúnta

source: Lockout is where an employer excludes the employees from work or suspends work or terminates their employment
ga: Is éard is frithdhúnadh ann, nuair a eisiann fostóir fostaithe ón obair nó nuair a chuireann fostóir an obair ar fionraí nó deireadh a chur le fostaíocht fostaithe

source: In unfair dismissals legislation, a lockout is considered a dismissal
ga: Sa reachtaíocht um dhífhostú éagórach, meastar gurb ionann frithdhúnadh agus dífhostú

source: Again, under Section 5 of the Unfair Dismissals Act 1977, it is considered an unfair dismissal if an employee is not reinstated or re-engaged after a lockout and one or more of the other employees are
ga: Athuair, faoi Alt 5 den Acht um Dhífhostú Éagórach, 1977, meastar gur dífhostú éagórach é mura n-athfhostaítear fostaí tar éis frithdhúnta nuair a dhéantar fostaí amháin nó níos mó a athfhostú

source: Dismissal for trade union activity or membership is automatically unfair under Section 6 of the Unfair Dismissals Act 1977
ga: Tá dífhostú mar gheall ar ghníomhaíocht nó ar bhallraíocht de cheardchumainn éagórach faoi Alt 6 den Acht um Dhífhostú Éagórach, 1977

source: An employee dismissed in such circumstances does not require any particular length of service in the job in order to enforce his/her rights
ga: Ní gá go raibh fostaí a dífhostaíodh faoi na cúinsí sin fostaithe ar feadh aon fhad ar leith sa phost chun a c(h)earta a fhorfheidhmiú

source: The definition of trade union activity is activity carried out with the employer’s consent or outside working hours
ga: Is é an sainmhíniú atá ar ghníomhaíocht ceardchumainn, gníomhaíocht faoina dtugtar gan toiliú an fhostóra nó lasmuigh d’uaireanta oibre

source: Strikes or other industrial action are not covered by this definition
ga: Ní chuimsítear stailceanna nó gníomhaíocht thionsclaíoch eile faoin sainmhíniú seo

source: The Workplace Relations Commission’s Code of Practice on Victimisation refers to victimisation arising from an employee’s membership or non-membership, activity or non-activity for a trade union or a manager discharging their managerial functions or any other employees
ga: Tagraíonn Cód Cleachtais an Choimisiúin um Chaidreamh san Áit Oibre ar Íospairt (pdf) d’íospairt mar gheall ar bhallraíocht nó neamhbhallraíocht fostaí, gníomhaíocht nó neamhghníomhaíocht i gcás ceardchumain nnó bainisteoir a dhéann a fheidhmeanna nó aon fhostaí eile

source: It applies to situations where there are no negotiating arrangements and where collective bargaining has not taken place
ga: Baineann sé le cásanna gan socruithe idirbheartaíochta agus nach bhfuil aon cómhargáil

source: The term victimisation is used to describe unfair treatment of an employee (including a manager)
ga: Úsáidtear an téarma íospairt chun cur síos a dhéanamh ar chaitheamh éagórach le fostaí (bainisteoir san áireamh)

source: It does not include dismissal – see ‘Unfair dismissal’ above
ga: Ní áiríonn sé dífhostú éagórach – féach ‘Dífhostú éagórach’ thíos

source: If you feel you have been victimised you can make a complaint to the Workplace Relations Commission under the Industrial Relations (Miscellaneous Provisions) Act 2004 using the online complaint form available on workplacerelations.ie
ga: Má bhraitheann tú go ndearnadh íospartach díot, féadfaidh tú gearán a dhéanamh le Coimisiún um Chaidreamh san Áit Oibre faoin Acht Caidrimh Thionscail (Forálacha Ilghnéitheacha) 2004 tríd an bhfoirm ghearáin a úsáid atá ar fáil ag workplacerelations.ie

source: Pay: Under the Payment of Wages Act 1991, deductions from your pay by your employer are allowed when they arise due to your being on strike
ga: Pá: Faoin Acht um Íoc Pá, 1991, ceadaítear do d’fhostóir asbhaintí ó do phá a dhéanamh nuair a eascraíonn siad mar gheall ort bheith ar stailc

source: Minimum pay: In the calculation of hourly rate of pay, ‘working hours’ does not include time when you were on strike
ga: Íosphá: Agus ráta pá in aghaidh na huaire á ríomh, ní áirítear le ‘huaireanta oibre’ an t-am a bhí tú ar stailc

source: Redundancy: Time spent on strike does not break the continuity of service required to qualify for redundancy
ga: Iomarcaíocht: Ní bhriseann an t-am a chaitear ar stailc leanúnachas na seirbhíse a theastaíonn chun cáiliú d’iomarcaíocht

source: However any time spent on strike during the last 3 years of your employment is non-reckonable when calculating the statutory redundancy payment
ga: Níl aon am a chaith tú ar stailc fad a bhí tú fostaithe le trí bliana anuas inríofa, áfach, nuair a bhíonn d’íocaíocht reachtúil iomarcaíochta á ríomh

source: Public holiday: You are not entitled to public holiday benefits if you have been absent from work immediately before the public holiday and your absence is due to a strike
ga: Saoire phoiblí: Níl tú i dteideal sochair shaoire poiblí a fháil má bhí tú as láthair ón obair díreach roimh shaoire phoiblí agus go raibh tú as láthair mar gheall ar stailc

source: If you are on strike, you are not considered unemployed and are not entitled to Jobseeker's Benefit or Allowance
ga: Má tá tú ar stailc, ní mheastar gurb ionann agus dífhostaithe atá tú agus níl tú i dteideal Sochar nó Liúntas Cuardaitheora Poist a fháil

source: However you may qualify for credits for the duration of the strike
ga: D’fhéadfaí thú a cháiliú do chreidmheasanna, áfach, d’fhad na stailce

source: Your family may get Supplementary Welfare Allowance
ga: D’fhéadfadh do theaghlach Liúntas Leasa Fhorlíontaigh a fháil

source: You won't normally be eligible for an Exceptional Needs Payment if you are involved in a trade dispute or on strike
ga: Ní gnách go mbeidh tú incháilithe chun Íocaíocht ar Riachtanais Eisceachtúla a fháil má tá baint agat i ndíospóid trádála nó má bhíonn tú ar stailc

source: However, a dependent adult or dependent child of a person on strike can apply
ga: Féadfaidh duine fásta neamhspleách nó leanbh neamhspleách atá ar stailc iarratas a dhéanamh

source: If you are out of work as a result of a strike (for example, you have been laid off), you are in a different position
ga: Mura bhfuil tú ag oibriú mar thoradh ar stailc, (mar shampla, má baineadh do phost díot), ní hionann an scéal é

source: You may qualify for Jobseeker's Benefit if you are not participating in or directly interested in the trade dispute which caused the stoppage at work
ga: D’fhéadfaí thú a cháiliú do Shochar Cuardaitheora Poist mura bhfuil páirt á glacadh agat nó mura bhfuil leas díreach agat sa díospóid trádála a bhí mar chúis leis an stopadh ag an obair
